rdbms/rdbms.org.html
<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf8"></meta>
    <title>rdbms.org</title>
    <link rel="stylesheet" href="/diary/resources/css/main.css" />
    <link rel="stylesheet" href="/diary/resources/highlight/styles/default.css" />
  </head>
  <body>
    <section class="main-article-area">
      <nav id='content'>
	<span id="prev">
	  	
	</span>

	<span id="home"><a href="/diary">Home</a></span>
	<span id="Up">
	  
	  <a href="/diary/rdbms">Up: rdbms</a>
	  	
	</span>

	<span id="next">
	  	
	</span>
      </nav>
      
      <div id='main'>
	<h1 id="design">Design</h1>
<h2 id="basic">Basic</h2>
<ol class="incremental">
<li>Eliminate Data Redundancy</li>
<li>Ensure Data Integrity and Accuracy</li>
</ol>
<h2 id="primary-key">Primary Key</h2>
<p>Can be a simple key or a composite key which should be</p>
<ol class="incremental">
<li>Integer if possible</li>
<li>AutoNumber</li>
<li>not change</li>
<li>unique</li>
<li>not null</li>
</ol>
<h2 id="relationship">Relationship</h2>
<ol class="incremental">
<li>one-to-many: foreign key</li>
<li>many-to-many: junction table</li>
<li>one-to-one</li>
</ol>
<h2 id="normalization"><span class="todo TODO">TODO</span> Normalization</h2>
<dl class="incremental">
<dt>1NF</dt>
<dd>no list or multiple column in table, use one-to-many relationship instead
</dd>
<dt>2NF</dt>
<dd>non-key column is fully dependent to primary key
</dd>
<dt>3NF</dt>
<dd>non-key columns are independent of each other
</dd>
<dt>Higher Normal Formal</dt>
<dd>Doyce, Codee and etc.
</dd>
</dl>
<h2 id="integrity-rules">Integrity Rules</h2>
<dl class="incremental">
<dt>Primary key (or ites field)</dt>
<dd>should not be null
</dd>
<dt>Referential Integrity Rule</dt>
<dd>Foreign key refers to primary key, be careful to the change of primary key
</dd>
<dt>Business Logic Integrity</dt>
<dd>such as zip code format
</dd>
</dl>
<h1 id="references">References</h1>
<ul class="incremental">
<li><a href="http://www.ntu.edu.sg/home/ehchua/programming/sql/relational_database_design.html">A Quick-Start Tutorial on Relational Database Design</a></li>
</ul>

      </div>
    </section>
  </body>
</html>
